#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-i4tXxTAcV6cNdg3T

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/588188670678/notification-queue]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_cloudwatch_event_rule.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_s3_bucket.api: Refreshing state... [id=ien-dev-api]
aws_cloudwatch_event_rule.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_lambda_function.SQSLambda: Refreshing state... [id=ien-dev-notifylambda]
aws_instance.bastion_instance: Refreshing state... [id=i-03cbe72a0cb0b49d7]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=7285274c-7a30-4d8f-8486-17f02ab95ff6]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.SyncApplicants: Refreshing state... [id=ien-dev-syncdata]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_s3_bucket_object.api_lambda: Refreshing state... [id=api-lambda-s3]
aws_lambda_permission.hmbc_to_ien_applicants: Refreshing state... [id=AllowExecutionFromCloudWatch_EarlyMorning]
aws_lambda_permission.hmbc_to_ien_masters: Refreshing state... [id=AllowExecutionFromCloudWatch_Morning]
aws_cloudwatch_event_target.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters-terraform-20220421203905121600000002]
aws_cloudwatch_event_target.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants-terraform-20220421203905110400000001]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.SQSLambda has changed
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
      ~ last_modified                  = "2023-03-06T22:10:36.000+0000" -> "2023-03-06T22:14:05.000+0000"
      ~ source_code_hash               = "6EzWN9whZmbuKdoPnyNi8Fh8xYwFcoPsA77Wf3Ba32g=" -> "YSac3+AyMXh5DZeATqzoqLejbDuBYtk6Pwba7H7vTSM="
      ~ source_code_size               = 52946716 -> 52946881
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants has changed
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
      ~ last_modified                  = "2023-03-06T22:10:36.000+0000" -> "2023-03-06T22:14:01.000+0000"
      ~ source_code_hash               = "6EzWN9whZmbuKdoPnyNi8Fh8xYwFcoPsA77Wf3Ba32g=" -> "YSac3+AyMXh5DZeATqzoqLejbDuBYtk6Pwba7H7vTSM="
      ~ source_code_size               = 52946716 -> 52946881
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2023-03-06T22:10:37.000+0000" -> "2023-03-06T22:13:58.000+0000"
      ~ source_code_hash               = "6EzWN9whZmbuKdoPnyNi8Fh8xYwFcoPsA77Wf3Ba32g=" -> "YSac3+AyMXh5DZeATqzoqLejbDuBYtk6Pwba7H7vTSM="
      ~ source_code_size               = 52946716 -> 52946881
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.api_lambda has changed
  ~ resource "aws_s3_bucket_object" "api_lambda" {
      ~ etag                   = "cfa919ee963dec0d742b8d1dd8132c4e-7" -> "bba5600ea5fd342ed26ca4a1f787b91b-7"
        id                     = "api-lambda-s3"
        tags                   = {}
      ~ version_id             = "O.HEfzri_LhhdWs_XOTnojpIz4Xd8Wo0" -> "PBRXiZZ29FsnyUZGPulucbNwSbqoTVrc"
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cache_report_four will be created
  + resource "aws_cloudwatch_event_rule" "cache_report_four" {
      + arn                 = (known after apply)
      + description         = "7:00AM UTC - 12:00AM PST Every day"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ien-dev-cache-report-four"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.cache_report_four will be created
  + resource "aws_cloudwatch_event_target" "cache_report_four" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + path = "cache-report-four"
            }
        )
      + rule           = "ien-dev-cache-report-four"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.CacheReportFour will be created
  + resource "aws_lambda_function" "CacheReportFour" {
      + arn                            = (known after apply)
      + description                    = "Trigger Caching of Report 4"
      + filename                       = "./build/empty_lambda.zip"
      + function_name                  = "ien-dev-cache-report-four"
      + handler                        = "api/cachereportfour.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::588188670678:role/ien-dev-lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "0XCcYIn0+jTjUwxPorWwPN2f8zZKRGEzZOOQyWVxIQw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUTH_REALM"        = (sensitive)
              + "AUTH_URL"          = (sensitive)
              + "AWS_S3_REGION"     = "ca-central-1"
              + "BUILD_ID"          = "72631e5"
              + "BUILD_INFO"        = "72631e5, GitHub, Merge-4ecedd31f407301992fe7b2a50dccf07e4a98e36-into-4fd254eaf76ca5762b031c607f359c66ef72987e, grafted, HEAD, refs/remotes/pull/503/merge"
              + "NODE_ENV"          = "production"
              + "POSTGRES_DATABASE" = "ien"
              + "POSTGRES_HOST"     = "ien-dev-db.cluster-ct57eoah4xou.ca-central-1.rds.amazonaws.com"
              + "POSTGRES_PASSWORD" = (sensitive)
              + "POSTGRES_USERNAME" = "freshworks"
              + "RUNTIME_ENV"       = "hosted"
              + "TARGET_ENV"        = "dev"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0a37263c5e776d030",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.SQSLambda will be updated in-place
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"                 = "8f257b4" -> "72631e5"
              ~ "BUILD_INFO"               = "8f257b4, Sunghwan Park, IEN-816-call-each-report-endpoint-separately, grafted, HEAD, tag: refs/tags/dev" -> "72631e5, GitHub, Merge-4ecedd31f407301992fe7b2a50dccf07e4a98e36-into-4fd254eaf76ca5762b031c607f359c66ef72987e, grafted, HEAD, refs/remotes/pull/503/merge"
                # (6 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants will be updated in-place
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "8f257b4" -> "72631e5"
              ~ "BUILD_INFO"        = "8f257b4, Sunghwan Park, IEN-816-call-each-report-endpoint-separately, grafted, HEAD, tag: refs/tags/dev" -> "72631e5, GitHub, Merge-4ecedd31f407301992fe7b2a50dccf07e4a98e36-into-4fd254eaf76ca5762b031c607f359c66ef72987e, grafted, HEAD, refs/remotes/pull/503/merge"
                # (13 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "8f257b4" -> "72631e5"
              ~ "BUILD_INFO"        = "8f257b4, Sunghwan Park, IEN-816-call-each-report-endpoint-separately, grafted, HEAD, tag: refs/tags/dev" -> "72631e5, GitHub, Merge-4ecedd31f407301992fe7b2a50dccf07e4a98e36-into-4fd254eaf76ca5762b031c607f359c66ef72987e, grafted, HEAD, refs/remotes/pull/503/merge"
                # (14 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.cache_report_four will be created
  + resource "aws_lambda_permission" "cache_report_four" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ien-dev-cache-report-four"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch_Morning"
    }

  # aws_s3_bucket.api will be updated in-place
  ~ resource "aws_s3_bucket" "api" {
        id                          = "ien-dev-api"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.app will be updated in-place
  ~ resource "aws_s3_bucket" "app" {
        id                          = "ien-dev-app"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 5 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $233.87200000000000272/mo +$0.0

```

</details>